# Client Project: The Lab @ DC

## Project Title: {here}

### Authors: {names}
- Cohorts of the Data Science Immersive, General Assembly @ Washington DC campus

In this notebook, we have Exploratory Data Analysis on the datasets. **This is notebook 2 of 3.**

### Import Libraries

In [1]:
# import basic libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

### Read CSVs

In [9]:
csr_train   = pd.read_csv('./assets/csr/csr_train.csv', low_memory=False)
shots_train = pd.read_csv('./assets/mpd/shots_train.csv', low_memory=False)
shots_test  = pd.read_csv('./assets/mpd/shots_test.csv', low_memory=False)

### Basic EDAs and Data Cleaning

In [10]:
csr_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1231233 entries, 0 to 1231232
Data columns (total 31 columns):
Unnamed: 0                    1231233 non-null int64
X                             1231233 non-null float64
Y                             1231233 non-null float64
OBJECTID                      1231233 non-null int64
SERVICECODE                   1231233 non-null object
SERVICECODEDESCRIPTION        1231233 non-null object
SERVICETYPECODEDESCRIPTION    1230379 non-null object
ORGANIZATIONACRONYM           1231232 non-null object
SERVICECALLCOUNT              1231233 non-null int64
ADDDATE                       1231233 non-null object
RESOLUTIONDATE                1145201 non-null object
SERVICEDUEDATE                1218530 non-null object
SERVICEORDERDATE              1231233 non-null object
INSPECTIONFLAG                1231233 non-null object
INSPECTIONDATE                434130 non-null object
INSPECTORNAME                 40361 non-null object
SERVICEORDERSTATUS            1230380 non-null object
STATUS_CODE                   1079432 non-null object
SERVICEREQUESTID              1231233 non-null object
PRIORITY                      1228556 non-null object
STREETADDRESS                 1181503 non-null object
XCOORD                        1231233 non-null float64
YCOORD                        1231233 non-null float64
LATITUDE                      1231233 non-null float64
LONGITUDE                     1231233 non-null float64
CITY                          1180909 non-null object
STATE                         1180909 non-null object
ZIPCODE                       1231217 non-null float64
MARADDRESSREPOSITORYID        1042071 non-null float64
WARD                          1225012 non-null object
DETAILS                       786667 non-null object
dtypes: float64(8), int64(3), object(20)
memory usage: 291.2+ MB

In [11]:
csr_train.isnull().sum().sort_values(ascending=False)

INSPECTORNAME                 1190872
INSPECTIONDATE                 797103
DETAILS                        444566
MARADDRESSREPOSITORYID         189162
STATUS_CODE                    151801
RESOLUTIONDATE                  86032
CITY                            50324
STATE                           50324
STREETADDRESS                   49730
SERVICEDUEDATE                  12703
WARD                             6221
PRIORITY                         2677
SERVICETYPECODEDESCRIPTION        854
SERVICEORDERSTATUS                853
ZIPCODE                            16
ORGANIZATIONACRONYM                 1
SERVICECALLCOUNT                    0
SERVICECODE                         0
OBJECTID                            0
Y                                   0
X                                   0
SERVICECODEDESCRIPTION              0
INSPECTIONFLAG                      0
ADDDATE                             0
SERVICEORDERDATE                    0
SERVICEREQUESTID                    0
XCOORD                              0
YCOORD                              0
LATITUDE                            0
LONGITUDE                           0
Unnamed: 0                          0
dtype: int64

##### Teams, two datasets have different digits in the Lat's and Long's. Will it be matters?

In [12]:
csr_train[['LATITUDE', 'LONGITUDE']].head()

    LATITUDE  LONGITUDE
0  38.897950 -76.972732
1  38.922857 -76.991905
2  38.874742 -76.970889
3  38.942811 -77.022676
4  38.898952 -77.048838

In [13]:
shots_train[['Latitude', 'Longitude']].head()

   Latitude  Longitude
0    38.917    -77.012
1    38.917    -77.002
2    38.917    -76.987
3    38.823    -77.000
4    38.893    -76.993

In [14]:
shots_train.head()

,Unnamed: 0,ID,Type,Date,Time,Source,Latitude,Longitude
0,0,5D39700,Multiple_Gunshots,2014-01-01,00:00:02,WashingtonDC5D,38.917,-77.012
1,1,5D39701,Multiple_Gunshots,2014-01-01,00:00:06,WashingtonDC5D,38.917,-77.002
2,2,5D39702,Multiple_Gunshots,2014-01-01,00:00:07,WashingtonDC5D,38.917,-76.987
3,3,7D119445,Multiple_Gunshots,2014-01-01,00:00:10,WashingtonDC7D,38.823,-77.000
4,4,1D55993,Multiple_Gunshots,2014-01-01,00:00:10,WashingtonDC1D,38.893,-76.993

In [15]:
shots_train.drop(['Unnamed: 0'], axis=1, inplace=True)

In [16]:
# What does the #D mean? Police Department Number? Is it important?
shots_train.Source.value_counts()

WashingtonDC7D    3011
WashingtonDC6D    2399
WashingtonDC4D    1340
WashingtonDC5D    1192
WashingtonDC3D     895
WashingtonDC1D     800
Name: Source, dtype: int64

In [19]:
# 3 different kinds of shots.
shots_train.Type.value_counts()

Multiple_Gunshots         4771
Single_Gunshot            3998
Gunshot_or_Firecracker     868
Name: Type, dtype: int64

In [23]:
csr_train.drop(['Unnamed: 0'], axis=1, inplace=True)

In [25]:
csr_train.set_index(['OBJECTID'], inplace=True)

In [29]:
csr_train.iloc[:5, :6]

,X,Y,SERVICECODE,SERVICECODEDESCRIPTION,SERVICETYPECODEDESCRIPTION,ORGANIZATIONACRONYM
OBJECTID,,,,,,
463232,-76.972735,38.897957,S0011,Alley Cleaning,Street Cleaning,DPW
463233,-76.991907,38.922865,S0321,Recycling Collection - Missed,Recycling,DPW
463234,-76.970891,38.874749,S0031,Bulk Collection,Bulk Collection,DPW
463235,-77.022678,38.942819,S0311,Rat Abatement,DOH,DOH
463236,-77.048840,38.898960,S0276,Parking Meter Repair,TOA,DDOT

In [32]:
csr_train.iloc[:5, 6:12]

,SERVICECALLCOUNT,ADDDATE,RESOLUTIONDATE,SERVICEDUEDATE,SERVICEORDERDATE,INSPECTIONFLAG
OBJECTID,,,,,,
463232,1,2014-01-02T13:27:40.000Z,2014-01-15T07:43:42.000Z,2014-02-18T13:27:40.000Z,2014-01-02T13:27:40.000Z,N
463233,1,2014-01-02T13:46:57.000Z,2014-01-06T12:39:39.000Z,2014-01-06T13:46:57.000Z,2014-01-02T13:46:57.000Z,N
463234,1,2014-01-02T13:57:46.000Z,2014-01-14T14:29:16.000Z,2014-01-23T13:57:46.000Z,2014-01-02T13:57:46.000Z,N
463235,1,2014-01-02T13:43:20.000Z,NaN,2014-02-24T13:43:20.000Z,2014-01-02T13:43:20.000Z,N
463236,1,2014-01-02T16:00:59.000Z,2014-01-07T16:33:48.000Z,2014-01-09T16:00:59.000Z,2014-01-02T16:00:59.000Z,N

In [33]:
csr_train.iloc[:5, 12:18]

,INSPECTIONDATE,INSPECTORNAME,SERVICEORDERSTATUS,STATUS_CODE,SERVICEREQUESTID,PRIORITY
OBJECTID,,,,,,
463232,NaN,NaN,CLOSED,NaN,14-00000654,STANDARD
463233,2014-01-06T12:39:00.000Z,"Bryant, Kevin",CLOSED,NaN,14-00000686,STANDARD
463234,NaN,NaN,CLOSED,NaN,14-00000707,STANDARD
463235,NaN,NaN,OPEN,NaN,14-00000677,STANDARD
463236,NaN,NaN,CLOSED,NaN,14-00000877,STANDARD

In [34]:
csr_train.iloc[:5, 18:24]

,STREETADDRESS,XCOORD,YCOORD,LATITUDE,LONGITUDE,CITY
OBJECTID,,,,,,
463232,2301 BENNING ROAD NE,402365.36,136678.02,38.897950,-76.972732,WASHINGTON
463233,1004 RHODE ISLAND AVENUE NE,400701.99,139442.62,38.922857,-76.991905,WASHINGTON
463234,2333 FAIRLAWN AVENUE SE,402526.12,134101.82,38.874742,-76.970889,WASHINGTON
463235,720 VARNUM STREET NW,398034.18,141657.91,38.942811,-77.022676,WASHINGTON
463236,700 - 799 BLOCK OF 22ND STREET NW,395763.56,136790.11,38.898952,-77.048838,WASHINGTON

In [35]:
csr_train.iloc[:5, 24:30]

,STATE,ZIPCODE,MARADDRESSREPOSITORYID,WARD,DETAILS
OBJECTID,,,,,
463232,DC,20002.0,48983.0,Ward 7,There is some dumping in the rear of this addr...
463233,DC,20018.0,76304.0,Ward 5,Has not been collected the past 4 weeks.
463234,DC,20020.0,286919.0,Ward 7,"1 television, 2 vacuums, 1 boom box,"
463235,DC,20011.0,249794.0,Ward 4,requesting ratb abatement
463236,DC,20052.0,NaN,2,Broken Parking Meter